# 작물 부위
area = {
    "1": "열매",
    "2": "꽃",
    "3": "잎",
    "4": "가지",
    "5": "줄기",
}

# 병해+생리장해+작물보호제 처리반응
disease = {
    "00": "정상",
    "a1": "딸기잿빛곰팡이병",
    "a2": "딸기흰가루병",
    "a3": "오이노균병",
    "a4": "오이흰가루병",
    "a5": "토마토흰가루병",
    "a6": "토마토잿빛곰팡이병",
    "a7": "고추탄저병",
    "a8": "고추흰가루병",
    "a9": "파프리카흰가루병",
    "a10": "파프리카잘록병",
    "a11": "시설포도탄저병",
    "a12": "시설포도노균병",
    "b1": "냉해피해",
    "b2": "열과",
    "b3": "칼슘결핍",
    "b4": "일소피해",
    "b5": "축과병",
    "b6": "다량원소결핍 (N)",
    "b7": "다량원소결핍 (P)",
    "b8": "다량원소결핍 (K)",
    "c1": "딸기잿빛곰팡이병반응",
    "c2": "딸기흰가루병반응",
    "c3": "오이노균병반응",
    "c4": "오이흰가루병반응",
    "c5": "토마토흰가루병반응",
    "c6": "토마토잿빛곰팡이병반응",
    "c7": "고추탄저병반응",
    "c9": "파프리카흰가루병반응",
    "c11": "시설포도탄저병반응",
    "c12": "시설포도노균병반응",
}

# 질병 피해정도
risk = {
    "0": "정상",
    "1": "초기",
    "2": "중기",
    "3": "말기",
}

# 생육단계 코드
grow = {
    "11": "유묘기",
    "12": "생장기",
    "13": "착화/과실기",
    "24": "과실성숙기",
    "25": "수확기",
}


def codes_to_text(area_code: str, disease_code: str, risk_code: str, grow_code: str) -> str:
    """
    각각 코드들에 알맞는 텍스트를 불러옵니다
    :type disease_code: object
    """
    return f"{area[area_code]}부분이며 {disease[disease_code]}에 걸렸습니다. 병의 진행 단계는 {risk[risk_code]}입니다. 해당 작물은 현재 {grow[grow_code]} 입니다."


def get_disease_name(code: str) -> str:
    """병해충명을 불러옵니다"""
    return disease[code]
